stage-02-web-lab/evidence/perf-test.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking web-01 (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests


Server Software:        nginx/1.24.0
Server Hostname:        web-01
Server Port:            80

Document Path:          /app/
Document Length:        178 bytes

Concurrency Level:      100
Time taken for tests:   0.084 seconds
Complete requests:      1000
Failed requests:        0
Non-2xx responses:      1000
Total transferred:      371000 bytes
HTML transferred:       178000 bytes
Requests per second:    11949.72 [#/sec] (mean)
Time per request:       8.368 [ms] (mean)
Time per request:       0.084 [ms] (mean, across all concurrent requests)
Transfer rate:          4329.44 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        1    4   1.0      3       9
Processing:     1    4   1.5      4      13
Waiting:        0    3   1.2      3      11
Total:          5    8   1.8      7      17

Percentage of the requests served within a certain time (ms)
  50%      7
  66%      8
  75%      8
  80%      9
  90%     11
  95%     12
  98%     13
  99%     13
 100%     17 (longest request)